src/OpenFOAM/OpenFOAM-7/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss limitedLinearV 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(phid,p)     Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;

    div(phiXi,Xi)   Gauss limitedLinear 1;
    div(phiSt,b)    Gauss limitedLinear01 1;

    div(phi,ft_b_ha_hau) Gauss multivariateSelection
    {
        ft              limitedLinear01 1;
        b               limitedLinear01 1;
        Xi              limitedLinear 1;
        ha              limitedLinear 1;
        hau             limitedLinear 1;
    };

    div((Su*grad(b)))               Gauss linear;
    div((U+((Su*Xi)*grad(b))))      Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))   Gauss linear;
    div(U)                          Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

// ************************************************************************* //
